In [1]:
# 1.Write code snippets in python to perform the following tasks
# • Print your current working directory
# • Create a new directory on your desktop named: “Text Mining and NLP”
# • Make “Text Mining and NLP” your current working directory

import os
print(os.getcwd())

C:\Users\sreer

In [2]:
os.chdir(r'C:\Users\sreer\desktop')
os.mkdir(r'Text Mining and NLP')
os.chdir(r'C:\Users\sreer\desktop\Text Mining and NLP')

print(os.getcwd())

C:\Users\sreer\desktop\Text Mining and NLP

In [3]:
# 2. Write code snippets in python to perform the following tasks:
# • Create a text file named “Greetings.txt” and write “Welcome to Text Mining and Natural Language Processing”
# • Move this file to the folder “Text Mining and NLP” which you created in ques 1
# • Rename this file to “Welcome.txt”

f = open(r'Greetings.txt', 'w')
f.write('Welcome to Text Mining and Natural Language Processing')
f.close()

In [4]:
os.replace(r'Greetings.txt', r'C:\Users\sreer\desktop\Text Mining and NLP\Greetings.txt')

In [5]:
os.rename(r'Greetings.txt', r'Welcome.txt')

In [6]:
# 3.You are given a docx file named “NLP.docx”. Perform the following tasks:
# • Use DOCX module to open the file and perform the following tasks:
# • How many paragraphs are there in the file?
# • For each paragraph, print the number of words it contains
# • Read the content from “Welcome.txt” file which you created in question number 2 and make that content the first paragraph in “NLP.docx” file


import docx
doc = docx.Document(r'C:\E\E_drive_copy\sample_data\nlp\ek\ast\data\NLP.docx')

In [7]:
len(doc.paragraphs) # no. of paragraphs

26

In [15]:
# the number of words in each paragraph

print('Paragraph  #words')
print('-----------------')
for i in range(len(doc.paragraphs)):
    print(f'para - {i+1} : ', len(doc.paragraphs[i].text.split()))

Paragraph  #words
-----------------
para - 1 :  72
para - 2 :  58
para - 3 :  133
para - 4 :  26
para - 5 :  6
para - 6 :  71
para - 7 :  38
para - 8 :  61
para - 9 :  47
para - 10 :  50
para - 11 :  9
para - 12 :  63
para - 13 :  37
para - 14 :  76
para - 15 :  95
para - 16 :  8
para - 17 :  43
para - 18 :  105
para - 19 :  33
para - 20 :  54
para - 21 :  59
para - 22 :  6
para - 23 :  79
para - 24 :  90
para - 25 :  70
para - 26 :  60

In [16]:
f = open(r'C:\Users\sreer\desktop\Text Mining and NLP\Welcome.txt', 'r')
content = f.read()
f.close()

In [17]:
content

'Welcome to Text Mining and Natural Language Processing'

In [20]:
doc2 = docx.Document()

doc2.add_paragraph(content)

for i in range(len(doc.paragraphs)):
    doc2.add_paragraph(doc.paragraphs[i].text)

doc2.save(r'C:\E\E_drive_copy\sample_data\nlp\ek\ast\data\NLP2.docx')

# NLP2.docx has 1st para with content of Welcome.txt and followed by content of NLP.docx

In [21]:
# 4.You are given a csv file named “EmployeeDetails.csv”. Perform the following tasks:
# • Use pandas module to read the csv file
# • Split the name as first name and last name and make two separate columns as shown
# • Delete “Name” Column
# • Increment the “Salary” Column by 10% of the existing value and save changes in same column only as shown
# • Save changes to a new file named “Employee_Data.csv”

import pandas as pd
df = pd.read_csv(r'C:\E\E_drive_copy\sample_data\nlp\ek\ast\data\EmployeeDetails.csv')

In [22]:
df

             Name   Age  Salary
0     Arjun singh    24   10000
1       Vibhor Jha   26   25000
2  Yoshita Debnath   23   15000
3   Abhitesh Setia   25   18000
4    Shaurya Nayar   26   30000
5      Disha Gupta   27   23000

In [24]:
df.columns

Index(['Name ', 'Age', 'Salary'], dtype='object')

In [25]:
df['Name '] = df['Name '].apply(lambda x:x.split())

In [26]:
df

                Name   Age  Salary
0      [Arjun, singh]   24   10000
1       [Vibhor, Jha]   26   25000
2  [Yoshita, Debnath]   23   15000
3   [Abhitesh, Setia]   25   18000
4    [Shaurya, Nayar]   26   30000
5      [Disha, Gupta]   27   23000

In [27]:
df['first_name'] = df['Name '].apply(lambda x:x[0])
df['last_name'] = df['Name '].apply(lambda x:x[1])

df

                Name   Age  Salary first_name last_name
0      [Arjun, singh]   24   10000      Arjun     singh
1       [Vibhor, Jha]   26   25000     Vibhor       Jha
2  [Yoshita, Debnath]   23   15000    Yoshita   Debnath
3   [Abhitesh, Setia]   25   18000   Abhitesh     Setia
4    [Shaurya, Nayar]   26   30000    Shaurya     Nayar
5      [Disha, Gupta]   27   23000      Disha     Gupta

In [30]:
df.drop(columns='Name ', inplace=True)
df

   Age  Salary first_name last_name
0   24   10000      Arjun     singh
1   26   25000     Vibhor       Jha
2   23   15000    Yoshita   Debnath
3   25   18000   Abhitesh     Setia
4   26   30000    Shaurya     Nayar
5   27   23000      Disha     Gupta

In [32]:
df['Salary'] = df['Salary'].apply(lambda x:x*1.1)

df

   Age   Salary first_name last_name
0   24  11000.0      Arjun     singh
1   26  27500.0     Vibhor       Jha
2   23  16500.0    Yoshita   Debnath
3   25  19800.0   Abhitesh     Setia
4   26  33000.0    Shaurya     Nayar
5   27  25300.0      Disha     Gupta

In [33]:
df.to_csv(r'C:\E\E_drive_copy\sample_data\nlp\ek\ast\data\Employee_Data.csv')